In [5]:
import pandas as pd

df = pd.read_excel('data.xlsx')
display(df)

   ID    Name Address  Age
0   0    Taro   Tokyo   20
1   1  Ichiro   Tokyo   19
2   2    Jiro   Osaka   22
3   3  Saburo   Kyoto   20
4   4   Shiro   Ehime   24

In [7]:
display(df.loc[[1,3], ['Name', 'Age']])

     Name  Age
1  Ichiro   19
3  Saburo   20

In [8]:
display(df.iloc[[1,2], [1,3]])

     Name  Age
1  Ichiro   19
2    Jiro   22